# Handling Missing Values

## isnull and notnull return booleans indicating whether a value is missing

In [1]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

df = pd.read_csv(url)
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [2]:
df.Age.isnull().sample(5)

1050     True
1002     True
872     False
1168     True
607     False
Name: Age, dtype: bool

In [3]:
df.Age.notnull().sample(5)

99      True
798    False
830     True
183    False
515     True
Name: Age, dtype: bool

In [4]:
df[df.Age.isnull()].sample(5)

                               Name PClass  Age     Sex  Survived  SexCode
980            Lyntakoff, Mr Stanko    3rd  NaN    male         0        0
594   Wilkinson, Mrs Elizabeth Anne    2nd  NaN  female         1        1
46            Carrau, Mr Jose Pedro    1st  NaN    male         0        0
1004            McElroy, Mr Michael    3rd  NaN    male         0        0
1062            Nenkoff, Mr Christo    3rd  NaN    male         0        0

In [5]:
import numpy as np

In [6]:
#df.Sex = df.Sex.replace("male",np.nan)
df.Age = df.Age.replace(np.nan,0)

In [7]:
df.sample(7)

,Name,PClass,Age,Sex,Survived,SexCode
588,"West, Mr Edwy Arthur",2nd,36.0,male,0,0
449,"Hold, Mrs Stephen (Annie Margaret)",2nd,36.0,female,1,1
238,"Snyder, Mr John Pillsbury",1st,24.0,male,1,0
1267,"Van Billiard, Master James William",3rd,0.0,male,0,0
717,"Chip, Mr Chang",3rd,32.0,male,0,0
513,"Navratil, Mr Michel",2nd,32.0,male,0,0
1228,"Storey, Mr Thomas",3rd,0.0,male,0,0